In [3]:
import pandas as pd
var=pd.DataFrame({"A":[2,4,6,8,10],"C":[4,8,12,16,20]})
var

    A   C
0   2   4
1   4   8
2   6  12
3   8  16
4  10  20

# Insert the Data into the Dataframe

In [4]:
#var.insert(index,column_name,data)
var.insert(1,"B",[3,6,9,12,15])
var

    A   B   C
0   2   3   4
1   4   6   8
2   6   9  12
3   8  12  16
4  10  15  20

# copy the data from one column to another

In [7]:
var["D"]=var["C"][:3]
var

    A   B   C     D
0   2   3   4   4.0
1   4   6   8   8.0
2   6   9  12  12.0
3   8  12  16   NaN
4  10  15  20   NaN

# Delete the data from the Dataframe

In [8]:
var1=var.pop("B")
var1

0     3
1     6
2     9
3    12
4    15
Name: B, dtype: int64

In [9]:
var

    A   C     D
0   2   4   4.0
1   4   8   8.0
2   6  12  12.0
3   8  16   NaN
4  10  20   NaN

In [19]:
del var["C"]
var

      D
0   4.0
1   8.0
2  12.0
3   NaN
4   NaN